БухЭксп/InformationRegisters/CW_СоответствияСинхронизацииГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствияСинхронизацииГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСинхронизацииГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ЭлектронныйОбменДанными/Ext/Module.bsl
Процедура ПроверитьКонтрагентаПоБазеЛКК(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();   
	
	Если ПустаяСтрока(ПараметрыПроцедуры.ИНН) Тогда
		Результат = Новый Структура;
		Результат.Вставить("СтатусОбмена",	0); // 1 - Использует модуль но не подклчюен, 2 - возможен обмен 

		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));  
	СтруктураJSON.Вставить("inn",		XMLСтрока(ПараметрыПроцедуры.ИНН)); 
	
	Если ПараметрыПроцедуры.Свойство("Организация") Тогда
		СтруктураJSON.Вставить("organization",	XMLСтрока(ПараметрыПроцедуры.Организация)); 
	КонецЕсли;
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("AFEx_checkinn", СтруктураJSON);

	HTTPОтвет = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");  
	
	status = 0;
	Если HTTPОтвет <> Неопределено и HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаJSON 	= HTTPОтвет.ПолучитьТелоКакСтроку();
		ОтветJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);  
		status 		= XMLЗначение(Тип("Число"), ОтветJSON["status"]);
	КонецЕсли;  
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусОбмена",	status); // 1 - Использует модуль но не подклчюен, 2 - возможен обмен 
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		 
КонецПроцедуры

Процедура ПолучитьДокументПоставщика(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт 
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));  
	СтруктураJSON.Вставить("innorg",	XMLСтрока(ПараметрыПроцедуры.ИННОрганизации));  
	СтруктураJSON.Вставить("innsupp",	XMLСтрока(ПараметрыПроцедуры.ИННRКонтрагента));  
	
	Если ПараметрыПроцедуры.Свойство("ИдентификаторДокумента") Тогда
		СтруктураJSON.Вставить("id", XMLСтрока(ПараметрыПроцедуры.ИдентификаторДокумента));   
	КонецЕсли;  
	
	Если ПараметрыПроцедуры.Свойство("Счет") Тогда
	    СтруктураJSON.Вставить("invoice", ПараметрыПроцедуры.Счет);
	КонецЕсли;
	Если ПараметрыПроцедуры.Свойство("Акт") Тогда
	    СтруктураJSON.Вставить("act", ПараметрыПроцедуры.Акт);
	КонецЕсли;
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("AFEx_suppliersdocument", СтруктураJSON);
	
	HTTPОтвет = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");  
	
	СтрокаJSON 	= HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Если HTTPОтвет.КодСостояния = 200 Тогда

		СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);  
		
		ДанныеСчета = Новый Структура;
		ДанныеСчета.Вставить("Счет", 	XMLЗначение(Тип("Булево"), 	СтруктураJSON["acc"]["be"]));
		ДанныеСчета.Вставить("Номер", 	XMLЗначение(Тип("Строка"), 	СтруктураJSON["acc"]["nomber"]));
		ДанныеСчета.Вставить("Дата", 	XMLЗначение(Тип("Дата"), 	СтруктураJSON["acc"]["data"]));
		
		ДанныеАкта = Новый Структура;
		ДанныеАкта.Вставить("Акт", 		XMLЗначение(Тип("Булево"), 	СтруктураJSON["act"]["be"]));
		ДанныеАкта.Вставить("Номер", 	XMLЗначение(Тип("Строка"), 	СтруктураJSON["act"]["nomber"]));
		ДанныеАкта.Вставить("Дата", 	XMLЗначение(Тип("Дата"), 	СтруктураJSON["act"]["data"]));
		
		ДанныеСчетаФактуры = Новый Структура;
		ДанныеСчетаФактуры.Вставить("СчетФактура",	XMLЗначение(Тип("Булево"), 	СтруктураJSON["inv"]["be"]));
		ДанныеСчетаФактуры.Вставить("Номер",		XMLЗначение(Тип("Строка"), 	СтруктураJSON["inv"]["nomber"]));
		ДанныеСчетаФактуры.Вставить("Дата", 		XMLЗначение(Тип("Дата"), 	СтруктураJSON["inv"]["data"]));
		
		ТабличныйДокумент  = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияJSON_XDTO(СтруктураJSON.tab);
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("УИД", XMLЗначение(Тип("УникальныйИдентификатор"), СтруктураJSON.id));
		ДанныеДокумента.Вставить("Счет", 				ДанныеСчета);   
		ДанныеДокумента.Вставить("Акт", 				ДанныеАкта);   
		ДанныеДокумента.Вставить("СчетФактура", 		ДанныеСчетаФактуры);   
		ДанныеДокумента.Вставить("ТабличныйДокумент", 	ТабличныйДокумент);   
		
		ПоместитьВоВременноеХранилище(ДанныеДокумента, АдресРезультата); 
	Иначе  
		
		Если ПустаяСтрока(СтрокаJSON) Тогда   
			ОписаниеКодовСостояния = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
			СтрокаJSON ="Код: " + СокрЛП(HTTPОтвет.КодСостояния)+" - "+СокрЛП(ОписаниеКодовСостояния.Получить(HTTPОтвет.КодСостояния));
		КонецЕсли;
		
		ПоместитьВоВременноеХранилище(СтрокаJSON, АдресРезультата); 
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ИзменитьРазрешенныеОрагнизацииНаСервере(РазрешенныеОрганизации) Экспорт 
	
	МассивJSON = новый Массив;
	Для Каждого Орагнизация из РазрешенныеОрганизации Цикл
		
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(Орагнизация, ТекущаяДата());
		
		ДанныеОрганизации = Новый Структура ;
		ДанныеОрганизации.Вставить("inn", 	XMLСтрока(Орагнизация.Инн)); 
		ДанныеОрганизации.Вставить("id", 	XMLСтрока(Орагнизация));
		ДанныеОрганизации.Вставить("name", 	XMLСтрока(СокрЛП(НаименованияНаДату.ПолноеНаименование)));
		
		МассивJSON.Добавить(ДанныеОрганизации);
		
	КонецЦикла;
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));  
	СтруктураJSON.Вставить("organization",	МассивJSON);                 
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("AFEx_changeorganization", СтруктураJSON);

	Структура = Новый Структура;
	
	HTTPОтвет = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");  
	
	Если HTTPОтвет.КодСостояния = 200 Тогда 
		
		СтрокаJSON 		= HTTPОтвет.ПолучитьТелоКакСтроку();
		СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON); 
		
		Для Каждого УИД из СтруктураJSON.error Цикл
			ОраганиазцияСсылка = XMLЗначение(тип("СправочникСсылка.Организации"), УИД);
			Если РазрешенныеОрганизации.Найти(ОраганиазцияСсылка) <> Неопределено Тогда 
				РазрешенныеОрганизации.Удалить(ОраганиазцияСсылка);                             
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;  
	
	Структура.Вставить("КодСостояния", 	HTTPОтвет.КодСостояния);	
	Структура.Вставить("Тело",			HTTPОтвет.ПолучитьТелоКакСтроку());	
	
	Возврат Структура;
	
КонецФункции


Функция ПолучитьШаблонГрузоперевозоки(ПарамтерыШаблона) Экспорт
	
	мТипыПеревозки = Новый Массив;
	мТипыПеревозки.Добавить(ПредопределенноеЗначение("Справочник.CW_ТипыПеревозок.ПустаяСсылка"));
	мТипыПеревозки.Добавить(ПарамтерыШаблона.ТипПеревозки);
	
	мКонтрагенты = Новый Массив;
	мКонтрагенты.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	мКонтрагенты.Добавить(ПарамтерыШаблона.Контрагент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_СоответствияСинхронизацииГрузоперевозок.Шаблон КАК Шаблон,
	               |	CW_СоответствияСинхронизацииГрузоперевозок.ТипПеревозки КАК ТипПеревозки,
	               |	CW_СоответствияСинхронизацииГрузоперевозок.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.CW_СоответствияСинхронизацииГрузоперевозок КАК CW_СоответствияСинхронизацииГрузоперевозок
	               |ГДЕ
	               |	CW_СоответствияСинхронизацииГрузоперевозок.ТипПеревозки В(&мТипыПеревозки)
	               |	И CW_СоответствияСинхронизацииГрузоперевозок.Контрагент В(&мКонтрагенты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипПеревозки,
	               |	Контрагент";

	Запрос.УстановитьПараметр("мТипыПеревозки",	мТипыПеревозки);
	Запрос.УстановитьПараметр("мКонтрагенты", 	мКонтрагенты);
	
    РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Шаблон;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.CW_ШаблоныСинхронизацииГрузоперевозок.Основной");
	
КонецФункции
